#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
aws_iam_role.codepipeline_role: Refreshing state... [id=sandbox_codepipeline_role]
aws_iam_role.codebuild_role: Refreshing state... [id=sandbox_codebuild_role]
module.aws-codebuild-pipeline-on-develop.module.codebuild_s3_bucket_pipeline.aws_s3_bucket.s3_bucket: Refreshing state... [id=sandbox-main-pipeline-pipeline-artifacts]
module.aws-codebuild-pipeline-on-develop.module.codebuild_project_apply.aws_codebuild_project.codebuild_project: Refreshing state... [id=arn:aws:codebuild:us-east-1:871266431850:project/sandbox-main-pipeline-apply]
module.aws-codebuild-pipeline-on-develop.module.codebuild_project_validate.aws_codebuild_project.codebuild_project: Refreshing state... [id=arn:aws:codebuild:us-east-1:871266431850:project/sandbox-main-pipeline-validate]
module.aws-codebuild-pipeline-on-develop.module.codebuild_project_plan.aws_codebuild_project.codebuild_project: Refreshing state... [id=arn:aws:codebuild:us-east-1:871266431850:project/sandbox-main-pipeline-plan]
aws_iam_role_policy.codepipeline_iam_policy: Refreshing state... [id=sandbox_codepipeline_role:terraform-20210122150322633500000002]
module.aws-codebuild-pipeline-on-develop.aws_codepipeline.pipeline: Refreshing state... [id=sandbox-main-pipeline-pipeline]
aws_iam_role_policy.codebuild_iam_policy: Refreshing state... [id=sandbox_codebuild_role:terraform-20210122150322458600000001]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.aws-codebuild-pipeline-on-develop.aws_codepipeline.pipeline will be updated in-place
  ~ resource "aws_codepipeline" "pipeline" {
        id       = "sandbox-main-pipeline-pipeline"
        name     = "sandbox-main-pipeline-pipeline"
        tags     = {}
        # (2 unchanged attributes hidden)

      - artifact_store {
          - location = "sandbox-main-pipeline-pipeline-artifacts" -> null
          - type     = "S3" -> null
        }
      + artifact_store {
          + location = (known after apply)
          + region   = (known after apply)
          + type     = "S3"
        }

        # (5 unchanged blocks hidden)
    }

  # module.codebuild_s3_bucket_pipeline.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "sandbox-pipeline-artifacts"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.aws-codebuild-pipeline-on-develop.module.codebuild_s3_bucket_pipeline.aws_s3_bucket.s3_bucket will be destroyed
  - resource "aws_s3_bucket" "s3_bucket" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::sandbox-main-pipeline-pipeline-artifacts" -> null
      - bucket                      = "sandbox-main-pipeline-pipeline-artifacts" -> null
      - bucket_domain_name          = "sandbox-main-pipeline-pipeline-artifacts.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "sandbox-main-pipeline-pipeline-artifacts.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "sandbox-main-pipeline-pipeline-artifacts" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @fgauna12, Action: `pull_request`*